In [1]:
import pandas as pd

In [2]:
myData=pd.read_csv("PersonsDetails.csv")
print(myData)
print()
print()

ages=[24,19,21,20,18,25,28]

myData["Ages"]=ages
print(myData)

  First_Names Last_Names       Full_Name         Ph_Num
0     Saqlain     Haider  Saqlain Haider  92***********
1      Haider        Ali      Haider Ali  92***********
2       Akbar      Rizvi     Akbar Rizvi  92***********
3         Ali     Haider      Ali Haider  92***********
4         Ali       Khan        Ali Khan  92***********
5      Hassan      Rizvi    Hassan Rizvi  92***********
6     Hussain        Ali     Hussain Ali  92***********


  First_Names Last_Names       Full_Name         Ph_Num  Ages
0     Saqlain     Haider  Saqlain Haider  92***********    24
1      Haider        Ali      Haider Ali  92***********    19
2       Akbar      Rizvi     Akbar Rizvi  92***********    21
3         Ali     Haider      Ali Haider  92***********    20
4         Ali       Khan        Ali Khan  92***********    18
5      Hassan      Rizvi    Hassan Rizvi  92***********    25
6     Hussain        Ali     Hussain Ali  92***********    28

***
# Checking starting & ending indexes

In [3]:
myData.index #start index is 1, stopping at 4 and each index's jump is by 1

RangeIndex(start=0, stop=7, step=1)

***
# Getting Header Column's names

In [4]:
myData.columns

Index(['First_Names', 'Last_Names', 'Full_Name', 'Ph_Num', 'Ages'], dtype='object')

***
# Getting some calculations of Numerical column's values

In [5]:
myData.describe()

            Ages
count   7.000000
mean   22.142857
std     3.625308
min    18.000000
25%    19.500000
50%    21.000000
75%    24.500000
max    28.000000

***

***
# Dealing with Rows
***

***
# Getting some data from begging(head) of any data set

In [6]:
myData.head(3)#by default it returns first 5 rows but we can also set no. of rows

  First_Names Last_Names       Full_Name         Ph_Num  Ages
0     Saqlain     Haider  Saqlain Haider  92***********    24
1      Haider        Ali      Haider Ali  92***********    19
2       Akbar      Rizvi     Akbar Rizvi  92***********    21

***
# Getting some data from ending(tail) of any data set.

In [7]:
myData.tail(2)#by default it returns last 5 rows but we can also set no. of rows

  First_Names Last_Names     Full_Name         Ph_Num  Ages
5      Hassan      Rizvi  Hassan Rizvi  92***********    25
6     Hussain        Ali   Hussain Ali  92***********    28

***
# Getting data from random rows

***

In [8]:
# this thing works same as slicing
rndmData=myData[3:7] # returns row-3 to row-6 data.

rndmData

  First_Names Last_Names     Full_Name         Ph_Num  Ages
3         Ali     Haider    Ali Haider  92***********    20
4         Ali       Khan      Ali Khan  92***********    18
5      Hassan      Rizvi  Hassan Rizvi  92***********    25
6     Hussain        Ali   Hussain Ali  92***********    28

***
# Making numpy array of pandas DataFrame

In [9]:
import numpy as np

In [10]:
print(rndmData)
print()
nData=np.asarray(rndmData)# asarray converts a pandas DataFrame into Numpy array
print(nData)

  First_Names Last_Names     Full_Name         Ph_Num  Ages
3         Ali     Haider    Ali Haider  92***********    20
4         Ali       Khan      Ali Khan  92***********    18
5      Hassan      Rizvi  Hassan Rizvi  92***********    25
6     Hussain        Ali   Hussain Ali  92***********    28

[['Ali' 'Haider' 'Ali Haider' '92***********' 20]
 ['Ali' 'Khan' 'Ali Khan' '92***********' 18]
 ['Hassan' 'Rizvi' 'Hassan Rizvi' '92***********' 25]
 ['Hussain' 'Ali' 'Hussain Ali' '92***********' 28]]

***
# Sorting Columns

In [11]:
myData.sort_index(axis=0,ascending=False)

  First_Names Last_Names       Full_Name         Ph_Num  Ages
6     Hussain        Ali     Hussain Ali  92***********    28
5      Hassan      Rizvi    Hassan Rizvi  92***********    25
4         Ali       Khan        Ali Khan  92***********    18
3         Ali     Haider      Ali Haider  92***********    20
2       Akbar      Rizvi     Akbar Rizvi  92***********    21
1      Haider        Ali      Haider Ali  92***********    19
0     Saqlain     Haider  Saqlain Haider  92***********    24

***

***
# Manipulation of data within DataFrame

In [12]:
print(myData)
print()
print(myData.loc[0,"Ages"]) # loc[rowIndex,col_Index/Name] is used to access specific cell

  First_Names Last_Names       Full_Name         Ph_Num  Ages
0     Saqlain     Haider  Saqlain Haider  92***********    24
1      Haider        Ali      Haider Ali  92***********    19
2       Akbar      Rizvi     Akbar Rizvi  92***********    21
3         Ali     Haider      Ali Haider  92***********    20
4         Ali       Khan        Ali Khan  92***********    18
5      Hassan      Rizvi    Hassan Rizvi  92***********    25
6     Hussain        Ali     Hussain Ali  92***********    28

24

In [13]:
print(myData)
print()
myData.loc[0,"First_Names"]="Syed Saqlain"
myData.loc[0,"Full_Name"]="Syed Saqlain Haider"
myData.loc[0,"Ages"]=23
myData.loc[5,"First_Names"]="Syed Hassan"
myData.loc[5,"Full_Name"]="Syed Hassan Rizvi"
myData.loc[5,"Ages"]=28
print(myData)

  First_Names Last_Names       Full_Name         Ph_Num  Ages
0     Saqlain     Haider  Saqlain Haider  92***********    24
1      Haider        Ali      Haider Ali  92***********    19
2       Akbar      Rizvi     Akbar Rizvi  92***********    21
3         Ali     Haider      Ali Haider  92***********    20
4         Ali       Khan        Ali Khan  92***********    18
5      Hassan      Rizvi    Hassan Rizvi  92***********    25
6     Hussain        Ali     Hussain Ali  92***********    28

    First_Names Last_Names            Full_Name         Ph_Num  Ages
0  Syed Saqlain     Haider  Syed Saqlain Haider  92***********    23
1        Haider        Ali           Haider Ali  92***********    19
2         Akbar      Rizvi          Akbar Rizvi  92***********    21
3           Ali     Haider           Ali Haider  92***********    20
4           Ali       Khan             Ali Khan  92***********    18
5   Syed Hassan      Rizvi    Syed Hassan Rizvi  92***********    28
6       Hussain        Ali          Hussain Ali  92***********    28

***
# Dealing with Rows & Cols
***

In [25]:
myData.loc[[0],:]

    First_Names Last_Names            Full_Name         Ph_Num  Ages
0  Syed Saqlain     Haider  Syed Saqlain Haider  92***********    23

***
**Specific cols and all rows**

In [14]:
allData=myData.loc[:,["Full_Name","Ages"]] # loc[ : ,[columns_index/names]]
print(allData)

             Full_Name  Ages
0  Syed Saqlain Haider    23
1           Haider Ali    19
2          Akbar Rizvi    21
3           Ali Haider    20
4             Ali Khan    18
5    Syed Hassan Rizvi    28
6          Hussain Ali    28

***
**All cols and specific rows**

In [15]:
allData=myData.loc[[0,5],:] # loc[ : ,[columns_index/names]]
print(allData)

    First_Names Last_Names            Full_Name         Ph_Num  Ages
0  Syed Saqlain     Haider  Syed Saqlain Haider  92***********    23
5   Syed Hassan      Rizvi    Syed Hassan Rizvi  92***********    28

***
**Specific cols and Specific rows**

In [16]:
allData=myData.loc[[0,5],["Full_Name","Ages"]] # loc[ [rows_index(s)] ,[columns_index/names]]
print(allData)

             Full_Name  Ages
0  Syed Saqlain Haider    23
5    Syed Hassan Rizvi    28

***

# Deletion of specific Col & Row

In [17]:
print(myData)
print()
print()

print(myData.drop(4,axis=0))

    First_Names Last_Names            Full_Name         Ph_Num  Ages
0  Syed Saqlain     Haider  Syed Saqlain Haider  92***********    23
1        Haider        Ali           Haider Ali  92***********    19
2         Akbar      Rizvi          Akbar Rizvi  92***********    21
3           Ali     Haider           Ali Haider  92***********    20
4           Ali       Khan             Ali Khan  92***********    18
5   Syed Hassan      Rizvi    Syed Hassan Rizvi  92***********    28
6       Hussain        Ali          Hussain Ali  92***********    28


    First_Names Last_Names            Full_Name         Ph_Num  Ages
0  Syed Saqlain     Haider  Syed Saqlain Haider  92***********    23
1        Haider        Ali           Haider Ali  92***********    19
2         Akbar      Rizvi          Akbar Rizvi  92***********    21
3           Ali     Haider           Ali Haider  92***********    20
5   Syed Hassan      Rizvi    Syed Hassan Rizvi  92***********    28
6       Hussain        Ali          Hussain Ali  92***********    28

***